###############################################################
#  Generated by:      Cadence Encounter 11.10-p003_1
#  OS:                Linux x86_64(Host ID IT059116)
#  Generated on:      Mon Aug 25 11:14:25 2014
#  Design:            pads
#  Command:           saveDesign -cellview {PADS-20140825-5d pads layout}
###############################################################
set sdc_version 1.4
current_design pads
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk_int}]  -name clk -period 1 -waveform {0 0.5}
set_propagated_clock  [get_ports {clk_int}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {clk_int}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {clk_int}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {clk_int}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {clk_int}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {sout_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {sout_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {sout_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {sout_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {sout_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {sout_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {sout_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {sout_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_low[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_low[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_low[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_low[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[7]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[6]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[5]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[4]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[3]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[2]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[1]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {field_toPAT_high[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {field_toPAT_high[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {field_toPAT_high[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {field_toPAT_high[0]}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {ring_osc_in_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {ring_osc_in_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {ring_osc_in_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {ring_osc_in_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {ring_osc_in_2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {ring_osc_in_2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {ring_osc_in_2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {ring_osc_in_2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_vdd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_vdd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_vdd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_vdd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_gnd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_gnd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_gnd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_gnd_core}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_vdd_1v8_all}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_vdd_1v8_all}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_vdd_1v8_all}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_vdd_1v8_all}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_gnd_all}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_gnd_all}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_gnd_all}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_gnd_all}]
set_load -pin_load -max  0.01  [get_ports {pad_clock_in}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_clock_out}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_clock_out}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_clock_out}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_clock_out}]
set_load -pin_load -max  0.01  [get_ports {pad_pwm_high}]
set_load -pin_load -max  0.01  [get_ports {pad_pwm_low}]
set_load -pin_load -max  0.01  [get_ports {pad_modesel_0}]
set_load -pin_load -max  0.01  [get_ports {pad_modesel_1}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a0}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a1}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a2}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a3}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a4}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a5}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a6}]
set_load -pin_load -max  0.01  [get_ports {pad_io_a7}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b0}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b1}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b2}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b3}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b4}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b5}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b6}]
set_load -pin_load -max  0.01  [get_ports {pad_io_b7}]
set_load -pin_load -max  0.01  [get_ports {pat_clock_division}]
set_max_transition 0.3  [get_ports {pat_clock_division}]
set_load -pin_load -max  0.01  [get_ports {reset_patternbuf_low}]
set_max_transition 0.3  [get_ports {reset_patternbuf_low}]
set_load -pin_load -max  0.01  [get_ports {reset_patternbuf_high}]
set_max_transition 0.3  [get_ports {reset_patternbuf_high}]
set_load -pin_load -max  0.01  [get_ports {pwm_low}]
set_max_transition 0.3  [get_ports {pwm_low}]
set_load -pin_load -max  0.01  [get_ports {pwm_high}]
set_max_transition 0.3  [get_ports {pwm_high}]
set_load -pin_load -max  0.01  [get_ports {sclk_low}]
set_max_transition 0.3  [get_ports {sclk_low}]
set_load -pin_load -max  0.01  [get_ports {sclk_high}]
set_max_transition 0.3  [get_ports {sclk_high}]
set_load -pin_load -max  0.01  [get_ports {sin_low}]
set_max_transition 0.3  [get_ports {sin_low}]
set_load -pin_load -max  0.01  [get_ports {sin_high}]
set_max_transition 0.3  [get_ports {sin_high}]
set_load -pin_load -max  0.01  [get_ports {ssel_low}]
set_max_transition 0.3  [get_ports {ssel_low}]
set_load -pin_load -max  0.01  [get_ports {ssel_high}]
set_max_transition 0.3  [get_ports {ssel_high}]
set_load -pin_load -max  0.01  [get_ports {saddr_low[2]}]
set_max_transition 0.3  [get_ports {saddr_low[2]}]
set_load -pin_load -max  0.01  [get_ports {saddr_low[1]}]
set_max_transition 0.3  [get_ports {saddr_low[1]}]
set_load -pin_load -max  0.01  [get_ports {saddr_low[0]}]
set_max_transition 0.3  [get_ports {saddr_low[0]}]
set_load -pin_load -max  0.01  [get_ports {saddr_high[2]}]
set_max_transition 0.3  [get_ports {saddr_high[2]}]
set_load -pin_load -max  0.01  [get_ports {saddr_high[1]}]
set_max_transition 0.3  [get_ports {saddr_high[1]}]
set_load -pin_load -max  0.01  [get_ports {saddr_high[0]}]
set_max_transition 0.3  [get_ports {saddr_high[0]}]
set_load -pin_load -max  0.01  [get_ports {bufp_low[2]}]
set_max_transition 0.3  [get_ports {bufp_low[2]}]
set_load -pin_load -max  0.01  [get_ports {bufp_low[1]}]
set_max_transition 0.3  [get_ports {bufp_low[1]}]
set_load -pin_load -max  0.01  [get_ports {bufp_low[0]}]
set_max_transition 0.3  [get_ports {bufp_low[0]}]
set_load -pin_load -max  0.01  [get_ports {bufp_high[2]}]
set_max_transition 0.3  [get_ports {bufp_high[2]}]
set_load -pin_load -max  0.01  [get_ports {bufp_high[1]}]
set_max_transition 0.3  [get_ports {bufp_high[1]}]
set_load -pin_load -max  0.01  [get_ports {bufp_high[0]}]
set_max_transition 0.3  [get_ports {bufp_high[0]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_low[4]}]
set_max_transition 0.3  [get_ports {fieldp_low[4]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_low[3]}]
set_max_transition 0.3  [get_ports {fieldp_low[3]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_low[2]}]
set_max_transition 0.3  [get_ports {fieldp_low[2]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_low[1]}]
set_max_transition 0.3  [get_ports {fieldp_low[1]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_low[0]}]
set_max_transition 0.3  [get_ports {fieldp_low[0]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_high[4]}]
set_max_transition 0.3  [get_ports {fieldp_high[4]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_high[3]}]
set_max_transition 0.3  [get_ports {fieldp_high[3]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_high[2]}]
set_max_transition 0.3  [get_ports {fieldp_high[2]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_high[1]}]
set_max_transition 0.3  [get_ports {fieldp_high[1]}]
set_load -pin_load -max  0.01  [get_ports {fieldp_high[0]}]
set_max_transition 0.3  [get_ports {fieldp_high[0]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_low[4]}]
set_max_transition 0.3  [get_ports {fieldwp_low[4]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_low[3]}]
set_max_transition 0.3  [get_ports {fieldwp_low[3]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_low[2]}]
set_max_transition 0.3  [get_ports {fieldwp_low[2]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_low[1]}]
set_max_transition 0.3  [get_ports {fieldwp_low[1]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_low[0]}]
set_max_transition 0.3  [get_ports {fieldwp_low[0]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_high[4]}]
set_max_transition 0.3  [get_ports {fieldwp_high[4]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_high[3]}]
set_max_transition 0.3  [get_ports {fieldwp_high[3]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_high[2]}]
set_max_transition 0.3  [get_ports {fieldwp_high[2]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_high[1]}]
set_max_transition 0.3  [get_ports {fieldwp_high[1]}]
set_load -pin_load -max  0.01  [get_ports {fieldwp_high[0]}]
set_max_transition 0.3  [get_ports {fieldwp_high[0]}]
set_load -pin_load -max  0.01  [get_ports {field_write_en_low}]
set_max_transition 0.3  [get_ports {field_write_en_low}]
set_load -pin_load -max  0.01  [get_ports {field_write_en_high}]
set_max_transition 0.3  [get_ports {field_write_en_high}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[7]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[7]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[6]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[6]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[5]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[5]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[4]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[4]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[3]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[3]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[2]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[2]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[1]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[1]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_low[0]}]
set_max_transition 0.3  [get_ports {field_fromPAT_low[0]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[7]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[7]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[6]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[6]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[5]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[5]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[4]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[4]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[3]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[3]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[2]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[2]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[1]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[1]}]
set_load -pin_load -max  0.01  [get_ports {field_fromPAT_high[0]}]
set_max_transition 0.3  [get_ports {field_fromPAT_high[0]}]
set_load -pin_load -max  0.01  [get_ports {ring_osc_enable_1_n}]
set_max_transition 0.3  [get_ports {ring_osc_enable_1_n}]
set_load -pin_load -max  0.01  [get_ports {ring_osc_enable_2_n}]
set_max_transition 0.3  [get_ports {ring_osc_enable_2_n}]
set_load -pin_load -max  0.01  [get_ports {ring_osc_trigger_n}]
set_max_transition 0.3  [get_ports {ring_osc_trigger_n}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b7}]
set_max_transition 0.3  [get_ports {pad_io_b7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b6}]
set_max_transition 0.3  [get_ports {pad_io_b6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b5}]
set_max_transition 0.3  [get_ports {pad_io_b5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b4}]
set_max_transition 0.3  [get_ports {pad_io_b4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b3}]
set_max_transition 0.3  [get_ports {pad_io_b3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a7}]
set_max_transition 0.3  [get_ports {pad_io_a7}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a6}]
set_max_transition 0.3  [get_ports {pad_io_a6}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a5}]
set_max_transition 0.3  [get_ports {pad_io_a5}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a4}]
set_max_transition 0.3  [get_ports {pad_io_a4}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a3}]
set_max_transition 0.3  [get_ports {pad_io_a3}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a2}]
set_max_transition 0.3  [get_ports {pad_io_a2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a1}]
set_max_transition 0.3  [get_ports {pad_io_a1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_a0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_a0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_a0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_a0}]
set_max_transition 0.3  [get_ports {pad_io_a0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_pwm_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_pwm_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_pwm_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_pwm_low}]
set_max_transition 0.3  [get_ports {pad_pwm_low}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_pwm_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_pwm_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_pwm_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_pwm_high}]
set_max_transition 0.3  [get_ports {pad_pwm_high}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_clock_in}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_clock_in}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_clock_in}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_clock_in}]
set_max_transition 0.3  [get_ports {pad_clock_in}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b2}]
set_max_transition 0.3  [get_ports {pad_io_b2}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b1}]
set_max_transition 0.3  [get_ports {pad_io_b1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_io_b0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_io_b0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_io_b0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_io_b0}]
set_max_transition 0.3  [get_ports {pad_io_b0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_modesel_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_modesel_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_modesel_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_modesel_1}]
set_max_transition 0.3  [get_ports {pad_modesel_1}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -min -pin Q [get_ports {pad_modesel_0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -min -pin Q [get_ports {pad_modesel_0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -rise -max -pin Q [get_ports {pad_modesel_0}]
set_driving_cell -lib_cell INVX2_HV -library h18_CORELIB_HV_TYP -fall -max -pin Q [get_ports {pad_modesel_0}]
set_max_transition 0.3  [get_ports {pad_modesel_0}]
set_wire_load_mode enclosed
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_low[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {bufp_low[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_low[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[6]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_high[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_high[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[6]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {bufp_high[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_low[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_high[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {bufp_low[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_low[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_low[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[7]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_high[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_low[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_high[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[7]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_write_en_low}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {bufp_low[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_high[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_write_en_high}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_low[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_low[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_high[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_high[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[4]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {bufp_high[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[0]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_low[2]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_low[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[5]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldp_high[3]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {fieldwp_high[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_high[5]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {field_fromPAT_low[1]}]
set_output_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {bufp_high[1]}]
set_false_path  -from [list [get_pins {theCore/reset}] [get_ports {pad_io_b2 pad_io_b1 pad_io_b0 pad_modesel_1 pad_modesel_0 reset_patternbuf_high reset_patternbuf_low}] ]
set_multicycle_path 2 -setup  -from [get_pins {{theCore/thePAT/thePC/pc_out_reg[2]/CP} {theCore/thePAT/thePC/pc_out_reg[3]/CP} {theCore/thePAT/thePC/pc_out_reg[5]/CP} {theCore/thePAT/thePC/pc_out_reg[4]/CP} {theCore/thePAT/thePC/pc_out_reg[1]/CP} {theCore/thePAT/thePC/pc_out_reg[0]/CP} {theCore/thePAT/thePC/pc_out_reg[8]/CP} {theCore/thePAT/thePC/pc_out_reg[7]/CP} {theCore/thePAT/thePC/pc_out_reg[6]/CP}}]  -to [get_pins {{theCore/iBuffer/i_buffer_reg[1][9]/D} {theCore/iBuffer/i_buffer_reg[1][9]/SE} {theCore/iBuffer/i_buffer_reg[1][9]/SI} {theCore/iBuffer/i_buffer_reg[1][8]/D} {theCore/iBuffer/i_buffer_reg[1][8]/SE} {theCore/iBuffer/i_buffer_reg[1][8]/SI} {theCore/iBuffer/i_buffer_reg[1][7]/D} {theCore/iBuffer/i_buffer_reg[1][7]/SE} {theCore/iBuffer/i_buffer_reg[1][7]/SI} {theCore/iBuffer/i_buffer_reg[1][6]/D} {theCore/iBuffer/i_buffer_reg[1][6]/SE} {theCore/iBuffer/i_buffer_reg[1][6]/SI} {theCore/iBuffer/i_buffer_reg[1][5]/D} {theCore/iBuffer/i_buffer_reg[1][5]/SE} {theCore/iBuffer/i_buffer_reg[1][5]/SI} {theCore/iBuffer/i_buffer_reg[1][4]/D} {theCore/iBuffer/i_buffer_reg[1][4]/SE} {theCore/iBuffer/i_buffer_reg[1][4]/SI} {theCore/iBuffer/i_buffer_reg[1][3]/D} {theCore/iBuffer/i_buffer_reg[1][3]/SE} {theCore/iBuffer/i_buffer_reg[1][3]/SI} {theCore/iBuffer/i_buffer_reg[1][2]/D} {theCore/iBuffer/i_buffer_reg[1][2]/SE} {theCore/iBuffer/i_buffer_reg[1][2]/SI} {theCore/iBuffer/i_buffer_reg[1][22]/D} {theCore/iBuffer/i_buffer_reg[1][22]/SE} {theCore/iBuffer/i_buffer_reg[1][22]/SI} {theCore/iBuffer/i_buffer_reg[1][21]/D} {theCore/iBuffer/i_buffer_reg[1][21]/SE} {theCore/iBuffer/i_buffer_reg[1][21]/SI} {theCore/iBuffer/i_buffer_reg[1][20]/D} {theCore/iBuffer/i_buffer_reg[1][20]/SE} {theCore/iBuffer/i_buffer_reg[1][20]/SI} {theCore/iBuffer/i_buffer_reg[1][1]/D} {theCore/iBuffer/i_buffer_reg[1][1]/SE} {theCore/iBuffer/i_buffer_reg[1][1]/SI} {theCore/iBuffer/i_buffer_reg[1][19]/D} {theCore/iBuffer/i_buffer_reg[1][19]/SE} {theCore/iBuffer/i_buffer_reg[1][19]/SI} {theCore/iBuffer/i_buffer_reg[1][18]/D} {theCore/iBuffer/i_buffer_reg[1][18]/SE} {theCore/iBuffer/i_buffer_reg[1][18]/SI} {theCore/iBuffer/i_buffer_reg[1][17]/D} {theCore/iBuffer/i_buffer_reg[1][17]/SE} {theCore/iBuffer/i_buffer_reg[1][17]/SI} {theCore/iBuffer/i_buffer_reg[1][16]/D} {theCore/iBuffer/i_buffer_reg[1][16]/SE} {theCore/iBuffer/i_buffer_reg[1][16]/SI} {theCore/iBuffer/i_buffer_reg[1][15]/D} {theCore/iBuffer/i_buffer_reg[1][15]/SE} {theCore/iBuffer/i_buffer_reg[1][15]/SI} {theCore/iBuffer/i_buffer_reg[1][14]/D} {theCore/iBuffer/i_buffer_reg[1][14]/SE} {theCore/iBuffer/i_buffer_reg[1][14]/SI} {theCore/iBuffer/i_buffer_reg[1][13]/D} {theCore/iBuffer/i_buffer_reg[1][13]/SE} {theCore/iBuffer/i_buffer_reg[1][13]/SI} {theCore/iBuffer/i_buffer_reg[1][12]/D} {theCore/iBuffer/i_buffer_reg[1][12]/SE} {theCore/iBuffer/i_buffer_reg[1][12]/SI} {theCore/iBuffer/i_buffer_reg[1][11]/D} {theCore/iBuffer/i_buffer_reg[1][11]/SE} {theCore/iBuffer/i_buffer_reg[1][11]/SI} {theCore/iBuffer/i_buffer_reg[1][10]/D} {theCore/iBuffer/i_buffer_reg[1][10]/SE} {theCore/iBuffer/i_buffer_reg[1][10]/SI} {theCore/iBuffer/i_buffer_reg[1][0]/D} {theCore/iBuffer/i_buffer_reg[1][0]/SE} {theCore/iBuffer/i_buffer_reg[1][0]/SI} {theCore/iBuffer/i_buffer_reg[0][9]/D} {theCore/iBuffer/i_buffer_reg[0][9]/SE} {theCore/iBuffer/i_buffer_reg[0][9]/SI} {theCore/iBuffer/i_buffer_reg[0][8]/D} {theCore/iBuffer/i_buffer_reg[0][8]/SE} {theCore/iBuffer/i_buffer_reg[0][8]/SI} {theCore/iBuffer/i_buffer_reg[0][7]/D} {theCore/iBuffer/i_buffer_reg[0][7]/SE} {theCore/iBuffer/i_buffer_reg[0][7]/SI} {theCore/iBuffer/i_buffer_reg[0][6]/D} {theCore/iBuffer/i_buffer_reg[0][6]/SE} {theCore/iBuffer/i_buffer_reg[0][6]/SI} {theCore/iBuffer/i_buffer_reg[0][5]/D} {theCore/iBuffer/i_buffer_reg[0][5]/SE} {theCore/iBuffer/i_buffer_reg[0][5]/SI} {theCore/iBuffer/i_buffer_reg[0][4]/D} {theCore/iBuffer/i_buffer_reg[0][4]/SE} {theCore/iBuffer/i_buffer_reg[0][4]/SI} {theCore/iBuffer/i_buffer_reg[0][3]/D} {theCore/iBuffer/i_buffer_reg[0][3]/SE} {theCore/iBuffer/i_buffer_reg[0][3]/SI} {theCore/iBuffer/i_buffer_reg[0][2]/D} {theCore/iBuffer/i_buffer_reg[0][2]/SE} {theCore/iBuffer/i_buffer_reg[0][2]/SI} {theCore/iBuffer/i_buffer_reg[0][22]/D} {theCore/iBuffer/i_buffer_reg[0][22]/SE} {theCore/iBuffer/i_buffer_reg[0][22]/SI} {theCore/iBuffer/i_buffer_reg[0][21]/D} {theCore/iBuffer/i_buffer_reg[0][21]/SE} {theCore/iBuffer/i_buffer_reg[0][21]/SI} {theCore/iBuffer/i_buffer_reg[0][20]/D} {theCore/iBuffer/i_buffer_reg[0][20]/SE} {theCore/iBuffer/i_buffer_reg[0][20]/SI} {theCore/iBuffer/i_buffer_reg[0][1]/D} {theCore/iBuffer/i_buffer_reg[0][1]/SE} {theCore/iBuffer/i_buffer_reg[0][1]/SI} {theCore/iBuffer/i_buffer_reg[0][19]/D} {theCore/iBuffer/i_buffer_reg[0][19]/SE} {theCore/iBuffer/i_buffer_reg[0][19]/SI} {theCore/iBuffer/i_buffer_reg[0][18]/D} {theCore/iBuffer/i_buffer_reg[0][18]/SE} {theCore/iBuffer/i_buffer_reg[0][18]/SI} {theCore/iBuffer/i_buffer_reg[0][17]/D} {theCore/iBuffer/i_buffer_reg[0][17]/SE} {theCore/iBuffer/i_buffer_reg[0][17]/SI} {theCore/iBuffer/i_buffer_reg[0][16]/D} {theCore/iBuffer/i_buffer_reg[0][16]/SE} {theCore/iBuffer/i_buffer_reg[0][16]/SI} {theCore/iBuffer/i_buffer_reg[0][15]/D} {theCore/iBuffer/i_buffer_reg[0][15]/SE} {theCore/iBuffer/i_buffer_reg[0][15]/SI} {theCore/iBuffer/i_buffer_reg[0][14]/D} {theCore/iBuffer/i_buffer_reg[0][14]/SE} {theCore/iBuffer/i_buffer_reg[0][14]/SI} {theCore/iBuffer/i_buffer_reg[0][13]/D} {theCore/iBuffer/i_buffer_reg[0][13]/SE} {theCore/iBuffer/i_buffer_reg[0][13]/SI} {theCore/iBuffer/i_buffer_reg[0][12]/D} {theCore/iBuffer/i_buffer_reg[0][12]/SE} {theCore/iBuffer/i_buffer_reg[0][12]/SI} {theCore/iBuffer/i_buffer_reg[0][11]/D} {theCore/iBuffer/i_buffer_reg[0][11]/SE} {theCore/iBuffer/i_buffer_reg[0][11]/SI} {theCore/iBuffer/i_buffer_reg[0][10]/D} {theCore/iBuffer/i_buffer_reg[0][10]/SE} {theCore/iBuffer/i_buffer_reg[0][10]/SI} {theCore/iBuffer/i_buffer_reg[0][0]/D} {theCore/iBuffer/i_buffer_reg[0][0]/SE} {theCore/iBuffer/i_buffer_reg[0][0]/SI}}] 
set_multicycle_path 4 -setup  -from [get_ports {pad_clock_in pad_modesel_1 pad_modesel_0 pad_clock_out pad_gnd_all pad_vdd_1v8_all pad_gnd_core pad_vdd_core ring_osc_in_2 ring_osc_in_1 field_toPAT_high[0] field_toPAT_high[1] field_toPAT_high[2] field_toPAT_high[3] field_toPAT_high[4] field_toPAT_high[5] field_toPAT_high[6] field_toPAT_high[7] field_toPAT_low[0] field_toPAT_low[1] field_toPAT_low[2] field_toPAT_low[3] field_toPAT_low[4] field_toPAT_low[5] field_toPAT_low[6] field_toPAT_low[7] sout_high sout_low clk_int}] 
set_multicycle_path 13 -setup  -from [get_ports {pad_io_b7 pad_io_b6 pad_io_b5 pad_io_b4 pad_io_b3 pad_io_a7 pad_io_a6 pad_io_a5 pad_io_a4 pad_io_a3 pad_io_a2 pad_io_a1 pad_io_a0 pad_pwm_low pad_pwm_high pad_io_b2 pad_io_b1 pad_io_b0}] 
set_ideal_network  [get_ports {pad_modesel_0}]
set_ideal_network  [get_pins {iopad_modesel_0/Y}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/TIE1_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/FILLCELLX1_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/FILLCELLX16_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/FILLCELLX8_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/FILLCELLX2_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/FILLCELLX4_HV}]
set_dont_use  [get_lib_cells {h18_IOLIB_HV_TYP/IOPAD5V_8_HV}]
set_dont_use  [get_lib_cells {h18_IOLIB_HV_TYP/IOPAD5V_3_HV}]
set_dont_use  [get_lib_cells {h18_IOLIB_HV_TYP/IOPAD5V_20_HV}]
set_dont_use  [get_lib_cells {h18_IOLIB_HV_TYP/IOPAD1V8_3_HV}]
set_dont_use  [get_lib_cells {h18_IOLIB_HV_TYP/IOPAD1V8_8_HV}]
set_dont_use  [get_lib_cells {h18_IOLIB_HV_TYP/IOPAD1V8_20_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/TIE0_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/FILLCELLX32_HV}]
set_dont_use  [get_lib_cells {h18_CORELIB_HV_TYP/BUSHDX1_HV}]
set_dont_touch  [get_cells {iopad_clock_select}]
set_dont_touch  [get_cells {iopad_f5v_select}]
set_dont_touch  [get_cells {iopad_vref_select}]
