# ####################################################################

#  Created by Encounter(R) RTL Compiler v11.20-s017_1 on Mon Aug 18 18:16:07 +0100 2014

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design patternbuffer

create_clock -name "clk" -add -period 1.0 -waveform {0.0 0.5} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports field_write_in]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {bufp_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {bufp_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {bufp_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {saddr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {saddr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {saddr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports ssel]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports sin]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports sclk]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports pwm]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clk]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports clk]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports reset]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports pwm]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports sclk]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports sin]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports ssel]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {saddr[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {saddr[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {saddr[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {bufp_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {bufp_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {bufp_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[4]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[3]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[4]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[3]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[7]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[6]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[5]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[4]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[3]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports field_write_in]
set_wire_load_mode "enclosed"
set_wire_load_selection_group "sub_micron" -library "h18_CORELIB_HV_TYP"
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/BUSHDX1_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX1_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX2_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX4_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX8_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX16_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX32_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/TIE0_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/TIE1_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_20_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_3_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_8_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_20_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_3_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_8_HV]
