# ####################################################################

#  Created by Encounter(R) RTL Compiler v11.20-s017_1 on Wed Aug 20 21:33:14 +0100 2014

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design patternbuffer

create_clock -name "clk" -add -period 1.0 -waveform {0.0 0.5} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports field_write_in]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {field_in_in[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldwp_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {fieldp_in[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {bufp_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {bufp_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {bufp_in[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {saddr[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {saddr[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports {saddr[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports ssel]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports sin]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports sclk]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports pwm]
set_input_delay -clock [get_clocks clk] -add_delay 0.25 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clk]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {field_byte_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {p_drive[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {n_drive[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_global_delay[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_enable_0]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_sense_0]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_0[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_enable_1]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_sense_1]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_enable_2]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_sense_2]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_enable_3]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_sense_3]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_3[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_3[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_3[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_enable_4]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_sense_4]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_4[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_4[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_4[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_4[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_4[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_enable_5]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports tweak_sense_5]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_5[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_5[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_delay_5[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_5[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {tweak_duration_5[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -1.0 [get_ports sout]
set_max_transition 0.3 [get_ports sout]
set_max_transition 0.3 [get_ports {field_byte_out[7]}]
set_max_transition 0.3 [get_ports {field_byte_out[6]}]
set_max_transition 0.3 [get_ports {field_byte_out[5]}]
set_max_transition 0.3 [get_ports {field_byte_out[4]}]
set_max_transition 0.3 [get_ports {field_byte_out[3]}]
set_max_transition 0.3 [get_ports {field_byte_out[2]}]
set_max_transition 0.3 [get_ports {field_byte_out[1]}]
set_max_transition 0.3 [get_ports {field_byte_out[0]}]
set_max_transition 0.3 [get_ports {p_drive[7]}]
set_max_transition 0.3 [get_ports {p_drive[6]}]
set_max_transition 0.3 [get_ports {p_drive[5]}]
set_max_transition 0.3 [get_ports {p_drive[4]}]
set_max_transition 0.3 [get_ports {p_drive[3]}]
set_max_transition 0.3 [get_ports {p_drive[2]}]
set_max_transition 0.3 [get_ports {p_drive[1]}]
set_max_transition 0.3 [get_ports {p_drive[0]}]
set_max_transition 0.3 [get_ports {n_drive[7]}]
set_max_transition 0.3 [get_ports {n_drive[6]}]
set_max_transition 0.3 [get_ports {n_drive[5]}]
set_max_transition 0.3 [get_ports {n_drive[4]}]
set_max_transition 0.3 [get_ports {n_drive[3]}]
set_max_transition 0.3 [get_ports {n_drive[2]}]
set_max_transition 0.3 [get_ports {n_drive[1]}]
set_max_transition 0.3 [get_ports {n_drive[0]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[7]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[6]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[5]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[4]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[3]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[2]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[1]}]
set_max_transition 0.3 [get_ports {tweak_global_delay[0]}]
set_max_transition 0.3 [get_ports tweak_enable_0]
set_max_transition 0.3 [get_ports tweak_sense_0]
set_max_transition 0.3 [get_ports {tweak_delay_0[2]}]
set_max_transition 0.3 [get_ports {tweak_delay_0[1]}]
set_max_transition 0.3 [get_ports {tweak_delay_0[0]}]
set_max_transition 0.3 [get_ports {tweak_duration_0[1]}]
set_max_transition 0.3 [get_ports {tweak_duration_0[0]}]
set_max_transition 0.3 [get_ports tweak_enable_1]
set_max_transition 0.3 [get_ports tweak_sense_1]
set_max_transition 0.3 [get_ports {tweak_delay_1[2]}]
set_max_transition 0.3 [get_ports {tweak_delay_1[1]}]
set_max_transition 0.3 [get_ports {tweak_delay_1[0]}]
set_max_transition 0.3 [get_ports {tweak_duration_1[1]}]
set_max_transition 0.3 [get_ports {tweak_duration_1[0]}]
set_max_transition 0.3 [get_ports tweak_enable_2]
set_max_transition 0.3 [get_ports tweak_sense_2]
set_max_transition 0.3 [get_ports {tweak_delay_2[2]}]
set_max_transition 0.3 [get_ports {tweak_delay_2[1]}]
set_max_transition 0.3 [get_ports {tweak_delay_2[0]}]
set_max_transition 0.3 [get_ports {tweak_duration_2[1]}]
set_max_transition 0.3 [get_ports {tweak_duration_2[0]}]
set_max_transition 0.3 [get_ports tweak_enable_3]
set_max_transition 0.3 [get_ports tweak_sense_3]
set_max_transition 0.3 [get_ports {tweak_delay_3[2]}]
set_max_transition 0.3 [get_ports {tweak_delay_3[1]}]
set_max_transition 0.3 [get_ports {tweak_delay_3[0]}]
set_max_transition 0.3 [get_ports {tweak_duration_3[1]}]
set_max_transition 0.3 [get_ports {tweak_duration_3[0]}]
set_max_transition 0.3 [get_ports tweak_enable_4]
set_max_transition 0.3 [get_ports tweak_sense_4]
set_max_transition 0.3 [get_ports {tweak_delay_4[2]}]
set_max_transition 0.3 [get_ports {tweak_delay_4[1]}]
set_max_transition 0.3 [get_ports {tweak_delay_4[0]}]
set_max_transition 0.3 [get_ports {tweak_duration_4[1]}]
set_max_transition 0.3 [get_ports {tweak_duration_4[0]}]
set_max_transition 0.3 [get_ports tweak_enable_5]
set_max_transition 0.3 [get_ports tweak_sense_5]
set_max_transition 0.3 [get_ports {tweak_delay_5[2]}]
set_max_transition 0.3 [get_ports {tweak_delay_5[1]}]
set_max_transition 0.3 [get_ports {tweak_delay_5[0]}]
set_max_transition 0.3 [get_ports {tweak_duration_5[1]}]
set_max_transition 0.3 [get_ports {tweak_duration_5[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports clk]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports reset]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports pwm]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports sclk]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports sin]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports ssel]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {saddr[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {saddr[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {saddr[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {bufp_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {bufp_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {bufp_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[4]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[3]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldp_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[4]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[3]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {fieldwp_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[7]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[6]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[5]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[4]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[3]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[2]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[1]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports {field_in_in[0]}]
set_driving_cell -lib_cell DFX1_HV -library h18_CORELIB_HV_TYP -pin "Q" [get_ports field_write_in]
set_wire_load_mode "enclosed"
set_wire_load_selection_group "sub_micron" -library "h18_CORELIB_HV_TYP"
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/BUSHDX1_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX1_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX2_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX4_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX8_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX16_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/FILLCELLX32_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/TIE0_HV]
set_dont_use [get_lib_cells h18_CORELIB_HV_TYP/TIE1_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_20_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_3_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD5V_8_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_20_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_3_HV]
set_dont_use [get_lib_cells h18_IOLIB_HV_TYP/IOPAD1V8_8_HV]
